org/软件工程.org
#+begin_quote
软件工程笔记记录，不跟随课堂
#+end_quote
* 绪论
** 软件的定义及特点
*** 定义
    ~软件是计算机系统中的程序、相关数据、及其说明文档。~ 其中 ~程序~ 是按照事先设计的功能和性能要求执行的指令序列； ~数据~ 是程序能正常操纵信息的数据结构； ~说明文档~ 包含与程序开发、维护和使用过程中有关的各种图文数据。
*** 特点
    1. 软件是一种逻辑实体，而不是具体的物理实体。
    2. 软件的生产与硬件不同
    3. 软件的运行在使用间无硬件的机械磨损。
** 软件的分类
*** 基于软件的功能划分
    1. 系统软件
    2. 支撑软件
    3. 应用软件
** 软件危机
*** 定义
    软件在开发和维护过程遇到的严重问题称之为软件危机。
    两大难题：
    * 如何开发软件，怎样满足对软件日益增长的需求。
    * 如何维护数量不断膨胀的已有软件。
*** 原因
    1. 忽略了需求分析。
    2. 开发过程无统一、规范的方法论，文件资料不齐全，忽略人与人的交流。
    3. 忽略测试阶段的工作，提交用户的软件质量差。
    4. 忽略软件的维护。
    5. 缺少规范而盲目编写程序。
*** 解决方法
**** 组织管理
     工程项目管理方法
**** 技术措施
     软件开发与方法
     软件工程
** 软件工程概念
   概念提出的目的是 ~倡导以工程的原理、原则和方法进行软件开发~ 。
** 软件工程基本原理
   1. 分阶段生命周期计划并严格管理
   2. 坚持进行阶段评审
   3. 实行严格的产品控制
   4. 采用现代程序设计技术
   5. 结果能清楚地审查
   6. 开发小组的人员应该少而精
   7. 承认不断改进软件工程实践的必要性
** 软件工程项目的基本目标
   软件工程的主要目标是生产具有正确性，可用性以及开销合适的产品。
** 软件工程的基本原则
   1. 抽象 abstract
   2. 信息隐藏 Information hiding
   3. 模块化 Modular
   4. 局部性 Locality
   5. 一致性 consistency
   6. 完整性 Completeness
   7. 可预测性 Predictability
** 软件生命周期
   计划, 开发, 运行
** 软件开发过程模型
   问题模型：指运用所掌握的知识，通过抽象，给出该问题的一个结构。
*** 瀑布模型
    六个基本活动，自上而下互相衔接的固定次序，如同“瀑布”一般，逐级下落。
**** 实际的瀑布模型
     问题所在：
     1. 各个阶段的划分完全固定，阶段之间产生大量的文档，极大地增加了工作量；
     2. 由于开发模型是线性的，用户只有等到整个过程的末期才能看到开发成果，从而增加了开发的风险；
     3. 早期的错误可能要等到开发后期的测试才能发现。
*** 快速原型模型
    快速建立一个原型，随后再细化软件的需求，最后再实现完整的原型系统。
*** 螺旋模型
    将瀑布模型和快速原型模型结合，适用于大型复杂的系统。
*** 增量模型
    软件被作为一系列的增量构建来设计，实现，继承和测试，每个构件是能够满足一定功能，并且能够最终组合成一个具有完整功能软件的模块。
*** 喷泉模型
    相比传统模型，具有更多的增量和迭代性质。
*** 构件组装模型
    通过面向对象的方式构件模型，将多个模型一一组合。
*** 统一过程RUP模型
    RUP（Rational unified process）统一软件开发过程。
    + RUP的核心工作流程
      * 商业建模
      * 需求
      * 分析和设计
      * 实现
      * 测试
      * 部署
      * 配置和变更管理
      * 项目管理
      * 环境
*** 微软过程模型
    规划阶段->设计阶段->开发阶段->稳定阶段->发布阶段
** 软件的开发工具
   | 类型       | 工具         |
   |------------+--------------|
   | 项目管理   | RUP          |
   | 配置管理   | ClearCase    |
   | 需求管理   | RequisitePro |
   | 可视化建模 | Rose         |
   | 自动化    | Robot        |
** 软件工程的最新发展动向
*** 软件工程合理的开发治理
*** 软件工程全球化协作发展
*** 软件工程模块化
*** 软件工程开放式计算
** 软件开发的本质 
   问题域到不同抽象层之间的概念和计算罗的映射，不同抽象层术语之间的“映射”，以及不同抽象层处理逻辑之间的“映射”。
* 软件需求与软件需求
** 需求的基本性质
   + 必要的
   + 无歧义的
   + 可测试的
   + 可跟踪的
   + 可测量的
** 功能需求
   功能需求规约了系统或系统构建必须执行的功能。
** 性能需求
   规约了一个系统或系统构建在性能方面具有的一些特性
** 外部接口需求
   规约了系统或系统构建必须与之交互的用户、硬件、软件或数据库元素。
* 结构化方法::重点
* 面向对象方法——UML::重点
* 面向对象方法——RUP::重点
* 软件测试
* 软件生存周期过程与管理
* 集成化能力成熟度模型(CMMI)
